/*
 * Классическая задача, которую можно встретить на собеседованиях самого разного уровня.
 *  Стоит напомнить, что последовательность Фибоначчи — это ряд чисел, где каждое последующее является суммой двух предыдущих.
 *  Так, первые десять чисел выглядят следующим образом: 0, 1, 1, 2, 3, 5, 8, 13, 21, 34.
 *
 * Нужно написать функцию, которая возвращает n-ную запись в определенной последовательности,
 *  причем n — число, которое передается в качестве аргумента функции.
 *
 * Эта задача включает прохождение по циклу такое количество раз,
 *  которое указано в аргументе, с возвратом значения на соответствующей позиции. Этот способ постановки задачи требует использования циклов.
 *  Вы можете использовать рекурсию
 * */

function fibonacci(num) {
  if (num === 0) return 0;
  if (num === 1) return 1;

  let a = 0;
  let b = 1;
  let c;

  for (let i = 2; i <= num; i++) {
    c = a + b;
    a = b;
    b = c;
  }
  return b;
}

module.exports = fibonacci;
